Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Normally used in conjunction with an argument array (argument[0...15]) to permit varying input arguments for a given script.
zh_cn: 一般和参数数组（argument[0...15]）同用以允许对给定脚本输入数量可变的参数。

source: Normally you want it to be awake (ie: participating in the physics world) right from the start, but sometimes this can lead to certain instabilities and unwanted effects due to the abrupt start of the physics simulation.
zh_cn: 通常你希望它从一开始就清醒（即：参与物理世界），但是由于物理模拟的突然启动，有时这可能会导致某些不稳定和不必要的影响。

source: Normally you would simply use the Step In button to do this, but you also have one for stepping over code and one for stepping out of the code.
zh_cn: 通常你只需要用跳入按钮来做这件事，不过你还有另外两个选择，一个跳过代码和一个跳出代码。

source: Normally you would try and keep them no larger than the size of the view or display window.
zh_cn: 通常不要超过视野或者显示窗口的大小。

source: Not
zh_cn: 非

source: Not Applicable
zh_cn: 不适用

source: Not Completed
zh_cn: 未完成

source: Not Connected
zh_cn: 未连接

source: Not Ready
zh_cn: 没有准备好

source: Not expecting {0} {1} assigned in room {2} in instance {3}'s variable '{4}' (expected {5})
zh_cn: 不期望在实例{3}的变量“{4}”（预期{5}）的房间{2}中分配{0} {1}

source: Not expecting {0} {1} assigned in {2}'s variable '{3}' (expected {4})
zh_cn: 不期望在{2}的变量“{3}”（期望{4}）中分配{0} {1}

source: Not found
zh_cn: 未找到

source: Not only can a child share code with its parent, but you can do checks and run code on parent objects and it will automatically include the child objects too, which saves a lot of time and energy.
zh_cn: 孩子不仅可以与父母共享代码，而且可以在父对象上执行检查和运行代码，并且还会自动包含子对象，从而节省了大量的时间和精力。

source: Not only can you pass arguments into a script, but you can also ask a script to return a value too (using the Return action), so you can use them to (for example) build calculating methods or give back an instance ID after a complex collision detection or any number of things.
zh_cn: 你不仅可以向脚本传递参数，你还可以要求脚本返回（Return）一个值（使用返回（Return）动作），因此你可以使用它们来（举个例子）构建一些计算方法或经过一系列复杂的碰撞检测之后反馈一个实例ID，又或者是其他的一些东西。

source: Note Editor
zh_cn: 便签编辑器

source: Note that a parent object doesn't have to have any events or code in it...
zh_cn: 请注意，父对象不必在其中包含任何事件或代码...

source: Note that after changing any preferences from this window you need to click the Apply button for them to take effect.
zh_cn: 请注意，从此窗口修改任何偏好设置你都需要点击应用（Apply）按钮来生效。

source: Note that although you appear to have two instances of the IDE running when you do this, they are both for the same project and you cannot have one project in one and another ion the other unless you specifically open two instances of GameMaker Studio 2.
zh_cn: 请注意，尽管在执行此操作时，您看似运行了两个 IDE 实例，但是它们都属于同一个项目，除非您专门打开了 GameMaker Studio 2 中的两个实例，否则无法将其中一个项目与另一个项目分开。

source: Note that both the optional "type" and the obligatory "description" parts of @param are not displayed by default in the IDE code complete, and to see them you must activate the options in the GML Preferences.
zh_cn: 注意，在@param中无论是可写可不写的"type"还是还是必须写的"description"，在IDE的代码补全当中默认是都不显示的，如果想查看它们你必须在GML 偏好设置(GML Preference)中激活相应选项。

source: Note that by default GameMaker Studio 2 will save your project automatically (depending on the Preferences that you have set) and this button is simply so you can force a save at any time.
zh_cn: 请注意，默认情况下， GameMaker Studio 2 将自动保存您的项目（取决于您设置的 首选项），此按钮可以使您随时强制保存。

source: Note that clicking the help button in the menu bar will also open the document, as will pressing .
zh_cn: 注意，在菜单条中点击帮助按钮或按下键也可以打开帮助文档。

source: Note that created variables in GameMaker Studio 2 are all stored as double-precision floating point numbers, but you can use other formats when dealing with extensions.
zh_cn: 请注意，在GameMaker Studio 2中创建的变量都被存储为一个双精度浮点数，但是当使用扩展的时候你可以使用其他类型。

source: Note that currently GameMaker Studio 2 does not support "true" boolean values, and actually accepts any real number below 0.5 as a false value, and any real number equal to (or greater than) 0.5 as being true.
zh_cn: 请注意，当前的GameMaker Studio 2还不支持“真正的”布尔值，并且实际上是视所有低于0.5的实数为假（false），所有大于等于0.5的值为真（true）。

source: Note that downloading and installing a runtime can take a few minutes, but you can see a progress bar for the download at the top right of the IDE:
zh_cn: 请注意，下载并安装运行环境需要几分钟，但是你可以在IDE的右上角看到一个进度条：

source: Note that if the game is in the foreground when the time for the notification comes, it will not be shown, but the asynchronous event will still trigger.
zh_cn: 需要注意的是，如果推送时程序运行在前台，通知将 不会 被展示，但是异步推送事件 仍会触发。

source: Note that if you are running GameMaker Studio 2 on a macOS system and are using a single button mouse, please use + to get a right mouse click .
zh_cn: 请注意，如果你在macOS系统上运行GameMaker Studio 2 ，并且使用单按钮鼠标，请 + 获取鼠标右键单击 。

source: Note that if you set the alpha value to 0, you will not see these icons.
zh_cn: 请注意，如果将Alpha值设置为0，则不会看到这些图标。

source: Note that in these cases the username/password/proxy details will always be required, and that the proxy IP should also have the port added, ie: xx.xx.xx.xx:port.
zh_cn: 注意，在这种情况下代理、用户名、密码 必须 填写，代理 IP 应该添加端口号，例如： xx.xx.xx.xx:port.

source: Note that installed tutorials and demos will have an additional icon which can be used to uninstall the project from your computer (this does not remove the tutorial or demo from your "Owned" list).
zh_cn: 注意：安装教程和演示将有额外的图标 可用于从您的计算机卸载该教程(它不会从你的 "已拥有" 列表里删除)。

source: Note that multiple case statements can be placed for the same statement.
zh_cn: 注意，同一个语句前可以出现多个case。

source: Note that not all options will be available for all resources and it will depend on the resource type or the folder as to which ones you can use.
zh_cn: 请注意，并非所有选项都可用于所有资源类型，你可以使用哪些选项取决于资源类型或是否为文件夹。

source: Note that on Window 8 and above, the GameMaker Studio 2 IDE will support pen devices too.
zh_cn: 请注意，在Windows 8或更高版本中，GameMaker Studio 2还会支持触控笔设备。

source: Note that on Windows 8 and above, the GameMaker Studio 2 IDE will support pen devices too.
zh_cn: 请注意，在Windows 8或更高的系统上，GameMaker Studio 2 IDE还会支持触控笔设备。

source: Note that on the HTML5 target, this value is the height of the browser window, rather than the physical display size.
zh_cn: 需要注意的是HTML5平台，这个值是 浏览器窗口的高度，而不是显示器的物理尺寸。

source: Note that on the HTML5 target, this value is the width of the browser window, rather than the physical display size.
zh_cn: 需要注意的是HTML5平台，这个值返回的是 浏览器窗口的宽度，而不是显示器的物理尺寸。

source: Note that resource names are limited to using only letters, digits and the underscore symbol "_" in a name of a sprite (and any other resource) all resources must start with a letter, not a number.
zh_cn: 请注意，对于资源名称仅限使用字母，数字和下划线符号“_”，所有资源必须以字母开头而不是数字开头。

source: Note that some of the tools are split diagonally and will draw either outlined or filled shapes depending on which side of the line you click on to select them
zh_cn: 请注意，某些工具是延对角线分割的，您需要点击对角线的某一侧来选择工具绘制轮廓线或填充形状

source: Note that some of these are specific to the File Watcher background process.
zh_cn: 注意其中一些是 文件监视器 的后台进程。

source: Note that sounds take up a lot of space on disk, so you should be careful when creating them for your game projects.
zh_cn: 请注意，声音在磁盘中会占用大量空间，所以在创建游戏项目时应该注意。

source: Note that tat the top left of the Resource Tree you have the Collapse All button which can be used to close all open resource folders.
zh_cn: 请注意，资源树左上角有 全部折叠 按钮 ，可用于关闭所有已打开的资源文件夹。

source: Note that the runtime_version folder will depend on the runtimes you have installed currently.
zh_cn: 注意 runtime_version 文件夹取决于你当前安装的运行时版本。

source: Note that the Step Event category has three sub-categories to "fine tune" timing within the instance, but in general you will use the main Step Event most.
zh_cn: 请注意，“步事件”类别下有三个子类别可以在实例中“微调”时间，但是一般情况下，您最常使用的是主要步事件。

source: Note that the YYC option will require extra setup.
zh_cn: 请注意，YYC选项需要额外安装。

source: Note that the YYC target may require extra tools to be installed for the platform selected, otherwise it will not work - you can find further information about this from the YoYo Games Help Center as well as on the individual target Preferences pages detailed in this manual.
zh_cn: 请注意，YYC可能需要为所选择的平台安装额外的工具，否则将无法正常工作 - 您可以从 YoYo Games 帮助中心 以及本手册中详细列出的各个目标 参考 页面中找到更多信息。

source: Note that the right mouse button menu on the resources that are not in the default view is slightly different and has the following options: Most of the options are obvious but it should be clarified that Create will permit you to create a new resource anywhere within the custom view of the project (it will be added into the correct resource folder in the default view of the resource tree), and Add from default view will permit you to carry over a resource from the default resource tree into the custom view.
zh_cn: 注意，不在默认视图中的资源其鼠标右键菜单 略有不同，具有以下选项： 大多数选项都是显而易见的，但应该说明， 创建 将允许您在项目的自定义视图中的任意位置创建新的资源（它将被添加到资源树的默认视图中的对应资源文件夹中），并 且从默认视图添加 选项将允许您将资源从默认资源树传输到自定义视图中。

source: Note that the section on events above simply gives an overview of how they work, but for full details on all the avaialble events, please see the following section:
zh_cn: 请注意，上面的事件部分简要概述了它们的工作原理，但是有关所有可用事件的详细信息，请参阅以下部分：

source: Note that there is also a section for Platform Specific Preferences which is listed in this section of the manual here.
zh_cn: 请注意，还有一个部分叫做特定平台偏好设置（Platform Specific Preferences）被列举在手册的这个位置。

source: Note that there will also appear context specific menu options in the top menu bar, depending on the window that you have focused on currently.
zh_cn: 请注意根据你目前焦点所在的窗口，顶部菜单栏还将出现 特定环境下的菜单选项。

source: Note that these are not mutually exclusive ways to make your games, and you can mix using GML with DnD™ as you wish, depending on your skill and requirements with either.
zh_cn: 值得注意的是，制作游戏时它们相互之间并不排斥，你可以混合使用GML和DnD™，根据你的技能和要求，随心所愿。

source: Note that this can also be set in the Global Game Settings and that it is only applicable Windows 7 and above - it will just use the default method if you have this option ticked and run on XP or Vista - and that it does not switch it on or off, for that you would use the function display_reset().
zh_cn: 注意，你也可以在全局游戏设定中设置并且只适用 Windows 7 或更高的系统 - XP 或者 Vista 上，勾上这个选项也将使用默认的方法 - 并且它 不会 开启或关闭垂直同步，因为那个你将需要使用到函数 display_reset()。

source: Note that this checks to see if an object is present in the resource tree, and not actually in the game room.
zh_cn: 请注意这个函数检查的是该物体是否出现在资源树中而非实际的游戏房间中。

source: Note that this command is the same as pressing the Clean Cache button in the IDE.
zh_cn: 注意这个命令和IDE的清理缓存按钮 是一样的。

source: Note that this command is the same as pressing the Create Executable button in the IDE.
zh_cn: 请注意这个命令和IDE中的 创建可执行文件 按钮 效果是一致的。

source: Note that this command is the same as pressing the Debug button in the IDE.
zh_cn: 注意这个命令和按下IDE的调试 按钮 是一样的。

source: Note that this command is the same as pressing the Run button in the IDE.
zh_cn: 请注意，这个命令和按下IDE的 运行 按钮 效果是一样的。

source: Note that this does not report if v-sync is active or not (you can switch function display_reset()), and that you can set the v-sync method from the Global Game Settings or using the function display_set_windows_alternate_sync().
zh_cn: 注意这个函数并不是报告垂直同步是否激活（这个通过切换函数 display_reset()实现），你可以在全局游戏设定中或者或者使用函数 display_set_windows_alternate_sync()来设置垂直同步的方法。

source: Note that this is not the same as checking if two arrays are the same using ==, which will not check to see if the two arrays hold equivalent values, but only to see if the arrays are referencing the same initial array.
zh_cn: 请注意，这并不与使用==来判断数组是否相同的方法完全一致，使用==判断的方法不会检测两个数组是否具有相同的值，而只会查看两个数组是否引用了同一个初始数组。

source: Note that this is a community run forum, so if you have a bug report or require technical assistance you should go to the Official Support Forums first (see above).
zh_cn: 请注意，这是一个社区论坛，所以如果您有错误要报告或需要技术帮助，您应该到官方支持论坛（见上文）。

source: Note that this is not an exclusive DnD™ interface, and you can switch between DnD™ and GML code using the right mouse button .
zh_cn: 请注意，这不是唯一的DND™访问接口，你可以切换 DnD™ 和 GML 代码，使用鼠标右键.

source: Note that this is not an exclusive GML interface, and you can switch between GML code and DnD™ using the right mouse button .
zh_cn: 请注意，这不是唯一的GML访问接口，你可以切换 DnD™ 和 GML 代码，使用鼠标右键 .

source: Note that this is only the main, general, options for the current project, but you may also have platform specific options being listed as a part of the Resource Tree.
zh_cn: 请注意，这只是当前项目的主要以及一般选项，其他平台特定选项作为 资源树 的一部分列出。

source: Note that this may affect the games performance and that not all information is available in real time.
zh_cn: 不过要注意这样也许会影响游戏表现，而且并不是所有的信息都会实时有效。

source: Note that this value may vary a lot during a session, but when you close your game, the compiler output window within GameMaker Studio 2 will show you the minimum and maximum as well as the average values for this (note that the minimum value can be negative!
zh_cn: 请注意，该值在会话期间可能有很大的变化，但是当您关闭游戏时，GameMaker Studio 2 中的编译器输出窗口将显示最小值和最大值以及平均值（请注意，最小值 可以 为负数！

source: Note that this will only restore the defaults for the section currently being edited.
zh_cn: 请注意，这只会恢复当前正在编辑的部分。

source: Note that to compile for iOS you will require an Apple Mac computer running OSX or higher as well as the relevant certificates and permissions.
zh_cn: 请注意，为了编译 iOS，您将需要运行 OSX 或更高版本的 Mac 计算机以及具备相关证书和权限。

source: Note that using Delete does not delete the resource from the project and it will still be visible in the default resource tree, which is the view you should be using if you wish to remove the resource completely and not just from the view.
zh_cn: 请注意，使用 删除 不会从项目中删除资源，并且仍将在默认资源树中显示该资源，如果您希望完全删除资源，而不仅仅是从视图中删除资源，则该视图应该是您所使用的视图。

source: Note that we assign the value argument0 to a temporary variable at the start.
zh_cn: 请注意，在开始的时候我们将值argument0赋给一个临时变量（Temporay Variable）

source: Note that we say "based on" because you don't actually place objects directly into the game room, but rather you place instances of these objects, which are basically copies (or clones if you prefer) of the object resource.
zh_cn: 请注意，我们说‘基于’是因为您并不能直接把物体放置在房间中，而是将这些对象的 实例 （相当于对象资源的副本或拷贝）放置入其中。

source: Note that when a reference to the search term is found, it will be opened in the current workspace and zoomed/panned to.
zh_cn: 请注意，当找到对应搜索项时，它将在当前工作空间中打开并放大/平移到聚焦位置。

source: Note that when holding these buttons, you simply have to move the mouse - not click nor drag, just move - and that if there is a general shortcut that normally requires the use of the or keys, you would use the Right keys of the keyboard instead.
zh_cn: 请注意，当按住这些键位的时候，你只需要移动鼠标即可——不需要点击也不需要拖拽——并且如果有一个常规的快捷键通常要求是哟个或键的时候，你可以改用键盘上的右边的相应键位。

source: Note that when holding these buttons, you simply have to move the mouse - not click nor drag, just move - and that if there is a general shortcut that normally requires the use of the / or keys, you would use the Right keys of the keyboard instead.
zh_cn: 请注意，当按住这些按钮时，你只需要 移动 鼠标 - 不是点击或拖拽，仅仅是移动 - 如果有一个需要使用含有 / 或 的快捷键，你需要使用右 边的按键来实现。

source: Note that when using DnD™ or GML code you can also select an action or a function (or keyword or whatever) and then press or click the middle mouse button to open the manual on the relevant page.
zh_cn: 请注意，当使用DnD™按钮或GML代码，你也可以选择一个动作或一个函数（再或者是一个关键字或者是别的什么东西），然后按下或者点击鼠标中键来在本帮助手册中打开相关页面。

source: Note that when you use the Debug Module, you can also add Breakpoints to your code or DnD™.
zh_cn: 请注意，当您使用调试模块时，您还可以添加 断点 到您的代码或 DnD™。

source: Note that while the resource tree is docked to the IDE by default, you can take it out and into its own window by clicking on the "Resources" text at the top and dragging.
zh_cn: 请注意，默认情况下，资源树停靠在IDE中，您可以通过点击 顶部的“资源”文本并将其拖放到系统桌面中。

source: Note that while working through a tutorial you can save the project at any time and close the IDE or even change projects without worrying about losing your place, since tutorials will store the page and section that you are currently working through every time you save the project.
zh_cn: 请注意，使用一个教程进行创作时，你可以随时保存工程并关闭IDE甚至改变工程，而无需担心失去你的当前位置，因为教程会保存该页面和你每次保存时正在创作的部分。

source: Note that you are free to distribute the games you create with GameMaker Studio 2 in any way you like, including selling them.
zh_cn: 请注意，您可以随意使用 GameMaker Studio 2 以任何您喜欢的方式分发您创建的游戏，包括销售。

source: Note that you can also use the keyboard shortcut / + T to open the Goto window.
zh_cn: 请注意，您也可以使用键盘快捷键 / + T 打开 Go to 窗口。

source: Note that you can place the origin anywhere you wish by simply clicking on the preview image, and you can also manually input the origin position by adding values into the x/y fields at the top.
zh_cn: 请注意，您只需单击预览图像即可将原点放置在所点击 的位置，也可以通过在顶部的x / y字段中添加值来手动设置原点位置。

source: Note that you can set the detection mode for the bounding box to be either automatic (the default value) or manual.
zh_cn: 请注意，您可以将边界框的检测模式设置为自动（默认值）或手动。

source: Note that you will need to have previously installed the required runtimes which is done from the section below the settings for the current runtime:
zh_cn: 请注意，你将需要预先安装必要的运行库，这些是在当前运行库下面的部分完成的：

source: Note the use of the word temporary here!
zh_cn: 注意这个词 临时 ！

source: Note too that a persistent object will still have its Game Start, Game End, Room Start and Room End events triggered, however if you restart the game (with, for example, the game_restart() function) all persistent objects will be removed and only exist when created again by the game.
zh_cn: 还要注意，持久化对象仍然会触发游戏开始，游戏结束，房间开始和房间结束事件，但是如果您重新启动游戏（例如，使用game_restart（）函数），则所有持久对象将被删除在游戏再次创建时存在。

source: Note too that if you plan on using 3D positional audio effects, then the initial sound file must be mono.
zh_cn: 还要注意的是，如果您打算使用3D音效，则初始声音文件 必须 是单声道的。

source: Notes
zh_cn: 注释

source: Notes Label Colour
zh_cn: 便签标签颜色

source: Notes are simply code editor windows which permit you to write anything.
zh_cn: 注释是一个允许你写任何东西的代码编辑器窗口。

source: Notes background colour
zh_cn: 便签背景颜色

source: Notes can also be grouped and re-ordered like any other resource.
zh_cn: 和其他资源一样，便签也可以被编组或调换顺序。

source: Notes icon colour
zh_cn: 便签图标颜色

source: Notice in the above example we use another enum to create an expression for "violet".
zh_cn: 请注意，上面的例子中我们使用了另一个枚举为"violet"创建了一个表达式。

source: Notice that the very first tile is blank in that image.
zh_cn: 请注意，该图像中的第一个图块是空白的。

source: Notification
zh_cn: 通知

source: Notification Hub
zh_cn: 通知中心

source: Notification timeout (ms)
zh_cn: 通知超时（毫秒）

source: Notifications
zh_cn: 通知

source: Now let's expand our array to include different positions...
zh_cn: 现在我们给数组扩展三个位置。

source: Now that we know what a normal array looks like, let's look at a 2D (two dimensional) array.
zh_cn: 现在我们知道了普通的数组，再看看二维（2D）数组。

source: Now to move on to creating sound effects for your project...
zh_cn: 现在我们来继续为您的项目创建声音效果...

source: Now to multiply by 2 in binary, we shift all the bits to the LEFT by one.
zh_cn: 现在将以二进制形式乘以 2，我们将所有位向左移一位。

source: Now what does this mean in binary?
zh_cn: 那么，二进制里这意味着什么？

source: Now you could add all the required code into each object that requires it, but in general you'd be better of creating a single script resource with the code in it and then calling that.
zh_cn: 为此你 可以 将实现这些效果的代码添加到每个物体的中，但是更好的方法是创建一个脚本资源，在其中输入实现上述功能的代码，然后在每个物体中调用它。

source: Now you would expect the final array to hold the values 900, 800, 700, etc...
zh_cn: 现在你期望最后的数组保存的值是900、 800、 700、等等……

source: Now, aside from being very useful for fast/simple multiplications, it's also very useful for setting specific BITs, without having to figure out the bit value.
zh_cn: 现在，除了对于快速/简单的乘法非常有用之外，它还不需要计算位值就可以设置特定的位。

source: Now, create another text file and add the same line, only this time you point it to the path for the second version of the game that you want to do side-by-side testing with, and you would save this as "GM_Test_2.bat".
zh_cn: 现在，创建另一个文本文件并添加相同的内容，只是这次你将它指向你想要并行测试的游戏的第二个版本的路径，并且您会将其保存为“GM_Test_2.bat”。

source: Now, if I were to do this without understanding binary, it would look like this:
zh_cn: 现在，如果我不理解二进制方法的话，代码会变成这样：

source: Now, the sharp-sighted amongst you might have noticed we've used both here (as is so often the case), but this is still only a couple of instructions.
zh_cn: 现在，思维敏锐的你可能已经察觉到，我们在此处两种方法都使用了（这也是常有的情况），但是，它仍然只是一组指令。

source: Now, this can be done by simply creating an array of positions within the room and then having the instance move between them, but that can be a chore to set up and is difficult to change, test and adapt for different things.
zh_cn: 你可以先简单地在房间中创建一些简单的位置排列，接着让实例在他们之间移动。但这个工作很繁重而且不好修改，测试和适配。

source: Now, we could create a shortcut to the runner like we did for the exe, and then change the parameters as necessary, but that means having to open and edit it between tests, which defeats the purpose of our using this functionality for side-by-side testing.
zh_cn: 现在，我们可以仿照上述对 exe 操作中那样为 runner 创建一个快捷方式，然后根据需要更改参数，但这意味着必须在测试之间打开并编辑它，这就违背了我们将此功能用于并行测试的目的。

source: Now, we say "based on" because you don't actually place objects directly into the game rooms, but rather you place instances of these objects which are basically copies (or clones if you prefer) of the object resource.
zh_cn: 现在,我们说“基于”因为你没物体直接进入游戏房间,而是你把< b0 > < / b0 >的这些物体实例基本上是副本(或如果你喜欢克隆)物体的资源。

source: Now, when calling this script in code anywhere, you will get auto-complete and argument help etc...
zh_cn: 现在，在其他任意位置的代码中调用该脚本的时候，就会有自动补全以及参数提示等信息了。

source: Now, when you place these instances in a room they will all behave the same, but look different, since they will "inherit" the events of the parent.
zh_cn: 现在，当你把这些实例放在一个房间里时，它们都会表现得相同，但是看起来是不同的，因为他们会“继承”父项的事件。

source: Now, when you run your game in debug mode it will pause at the point (or points) that you have defined.
zh_cn: 现在，当你在调试模块中运行游戏的时候，它就会暂停在你定下的断点（们）上了。

source: Now, you can check a lot of these things yourself by adding in so-called "debug code" to your games to display on the screen the information you require, or you can have it that it shows messages when there is an error, but this is often a lot of work and if you aren't sure where the problem is in the first place then it can be a time consuming case of trial and error to track down your bug.
zh_cn: 现在，您可以通过在游戏中添加所谓的“调试代码”，来在屏幕上显示所需的信息，或者您可以使它在出现错误时显示消息，这样可以自己检查这些信息，但是这通常会带来大量的工作，如果您不确定问题在哪里，那么您可能在尝试和错误的追踪错误上耗费大量时间。

source: Now, you can try to achieve this by using the Alarm Events in an instance, but when things get too complicated this won't work any more, especially as you are limited to only twelve alarms.
zh_cn: 您可以通过在实例中使用 闹钟事件 来实现该目的，但是当事情很复杂的时候，闹钟事件就不太适用了，特别是闹钟事件的设置上限为12个。

source: Now, you can try to achieve this by using the alarm events but when things get too complicated this won't work any more, especially as you are limited to only twelve alarms.
zh_cn: 通常，你可以使用定时事件来完成这件事，但是当你的要完成的事情过于复杂的时候这根本行不通，特别是你只有12个定时器可以用。

source: Now, you want the player to die if he touches any of these four objects and this would normally entail four different collision events with four different sets of actions or code, one for each of the enemy objects.
zh_cn: 现在，如果他触摸到这四个对象中的任何一个，你想要玩家死亡，这通常会导致四个不同的碰撞事件与四个不同的动作或代码集合，一个对于每个敌对象。

source: Number
zh_cn: 数字

source: Number Theory
zh_cn: 数论

source: Number To String
zh_cn: 数字转字符串

source: Number of Frames
zh_cn: 帧数

source: Numberpad 0
zh_cn: 小键盘 0

source: Numberpad 3
zh_cn: 小键盘 3

source: Numberpad 4
zh_cn: 小键盘 4

source: Numberpad 9
zh_cn: 小键盘 9

source: Numbers
zh_cn: 数字

source: Numeric Input
zh_cn: 数字输入

source: Numeric Textbox
zh_cn: 数字文本框

source: Numpad9]
zh_cn: 小键盘9]

source: OK
zh_cn: 确定

source: Object
zh_cn: 物体

source: Object Editor
zh_cn: 物体编辑器

source: Object Editor Async Events
zh_cn: 物体编辑器异步事件

source: Object Editor Events List
zh_cn: 对象编辑器事件列表

source: Object Editor Events Menu
zh_cn: 对象编辑器事件菜单

source: Object Editor Events View
zh_cn: 对象编辑器事件视图

source: Object Editor Gesture Events
zh_cn: 物体编辑器的手势事件

source: Object Editor Named Events
zh_cn: 物体编辑器命名事件

source: Object Editor Physics
zh_cn: 对象编辑器物理学

source: Object Editor Physics Shape Editor
zh_cn: 对象编辑器物理形状编辑器

source: Object Editor Physics Shape Type
zh_cn: 对象编辑器物理形状类型

source: Object Editor Preferences
zh_cn: 物体编辑器的偏好设置

source: Object Events
zh_cn: 物体事件

source: Object Events List
zh_cn: 对象事件列表

source: Object Following
zh_cn: 物体跟随
